fio-test/results/rand_read_out_conv_2/1024k-io_uring-5.out
job1: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=io_uring, iodepth=256
fio-3.28
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=70020: Wed Sep  4 22:34:09 2024
  read: IOPS=11.8k, BW=11.5GiB/s (12.3GB/s)(160GiB/13924msec)
    slat (nsec): min=316, max=106448, avg=2056.58, stdev=2226.25
    clat (msec): min=2, max=131, avg=21.75, stdev=10.71
     lat (msec): min=2, max=131, avg=21.75, stdev=10.71
    clat percentiles (msec):
     |  1.00th=[    9],  5.00th=[   10], 10.00th=[   11], 20.00th=[   12],
     | 30.00th=[   14], 40.00th=[   17], 50.00th=[   20], 60.00th=[   23],
     | 70.00th=[   27], 80.00th=[   33], 90.00th=[   37], 95.00th=[   40],
     | 99.00th=[   46], 99.50th=[   59], 99.90th=[   95], 99.95th=[  110],
     | 99.99th=[  127]
   bw (  MiB/s): min= 4134, max=24322, per=96.21%, avg=11320.65, stdev=5357.10, samples=27
   iops        : min= 4134, max=24322, avg=11320.63, stdev=5357.13, samples=27
  lat (msec)   : 4=0.01%, 10=6.84%, 20=44.93%, 50=47.50%, 100=0.65%
  lat (msec)   : 250=0.08%
  cpu          : usr=2.86%, sys=5.04%, ctx=144194, majf=0, minf=93
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=163840,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=11.5GiB/s (12.3GB/s), 11.5GiB/s-11.5GiB/s (12.3GB/s-12.3GB/s), io=160GiB (172GB), run=13924-13924msec

Disk stats (read/write):
    dm-0: ios=86054/0, merge=0/0, ticks=65660/0, in_queue=65660, util=99.53%, aggrios=80971/0, aggrmerge=56852/0, aggrticks=39325/0, aggrin_queue=39325, aggrutil=79.89%
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme3n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme1n2: ios=155051/0, merge=120597/0, ticks=74213/0, in_queue=74213, util=79.88%
  nvme4n2: ios=155052/0, merge=120596/0, ticks=79244/0, in_queue=79244, util=79.88%
  nvme2n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme0n2: ios=155052/0, merge=120596/0, ticks=73513/0, in_queue=73513, util=79.89%
  nvme3n2: ios=172280/0, merge=103368/0, ticks=85037/0, in_queue=85037, util=79.88%
  nvme1n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme4n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n2: ios=172279/0, merge=103369/0, ticks=81249/0, in_queue=81249, util=79.87%