fio-test/results/rand_read_out_conv_2/8192k-io_uring-4.out
job1: (g=0): rw=randread, bs=(R) 8192KiB-8192KiB, (W) 8192KiB-8192KiB, (T) 8192KiB-8192KiB, ioengine=io_uring, iodepth=256
fio-3.28
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=955834: Mon Sep 16 02:12:32 2024
  read: IOPS=1551, BW=12.1GiB/s (13.0GB/s)(160GiB/13198msec)
    slat (nsec): min=543, max=65199, avg=2527.61, stdev=2298.45
    clat (msec): min=14, max=437, avg=164.95, stdev=70.50
     lat (msec): min=14, max=437, avg=164.95, stdev=70.50
    clat percentiles (msec):
     |  1.00th=[   75],  5.00th=[   80], 10.00th=[   85], 20.00th=[   94],
     | 30.00th=[  107], 40.00th=[  131], 50.00th=[  150], 60.00th=[  178],
     | 70.00th=[  213], 80.00th=[  241], 90.00th=[  259], 95.00th=[  284],
     | 99.00th=[  338], 99.50th=[  363], 99.90th=[  409], 99.95th=[  422],
     | 99.99th=[  430]
   bw (  MiB/s): min= 4912, max=25552, per=98.39%, avg=12214.08, stdev=5588.83, samples=26
   iops        : min=  614, max= 3194, avg=1526.73, stdev=698.62, samples=26
  lat (msec)   : 20=0.01%, 50=0.04%, 100=26.52%, 250=59.12%, 500=14.31%
  cpu          : usr=0.45%, sys=0.92%, ctx=19770, majf=0, minf=13
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=20480,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=12.1GiB/s (13.0GB/s), 12.1GiB/s-12.1GiB/s (13.0GB/s-13.0GB/s), io=160GiB (172GB), run=13198-13198msec

Disk stats (read/write):
    dm-0: ios=75254/0, merge=0/0, ticks=60784/0, in_queue=60784, util=99.48%, aggrios=73813/0, aggrmerge=63914/0, aggrticks=38845/0, aggrin_queue=38846, aggrutil=81.11%
  nvme0n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme3n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme1n2: ios=139880/0, merge=135577/0, ticks=72962/0, in_queue=72963, util=81.11%
  nvme4n2: ios=152793/0, merge=122663/0, ticks=81190/0, in_queue=81190, util=81.11%
  nvme2n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme0n2: ios=139880/0, merge=135578/0, ticks=72289/0, in_queue=72289, util=81.11%
  nvme3n2: ios=152792/0, merge=122664/0, ticks=83058/0, in_queue=83058, util=81.11%
  nvme1n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme4n1: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  nvme2n2: ios=152791/0, merge=122665/0, ticks=78959/0, in_queue=78960, util=81.09%